misterniark/Meshpay-V2/sdkconfig.defaults.esp32
CONFIG_IDF_TARGET="esp32"

# Default ESP32 smoke target: CYD profile with a serial LoRa module.
# CONFIG_MESHPAY_BOARD_UNKNOWN is not set
CONFIG_MESHPAY_BOARD_CYD=y
# CONFIG_MESHPAY_RADIO_ESPNOW is not set
CONFIG_MESHPAY_RADIO_LORA_UART=y
CONFIG_MESHPAY_LORA_UART_PORT=1
CONFIG_MESHPAY_LORA_UART_TX_IO=-1
CONFIG_MESHPAY_LORA_UART_RX_IO=-1
CONFIG_MESHPAY_LORA_UART_BAUD=9600
